app/controllers/orders_controller.rb

  def index
    @order = Order.includes(:line_items).find_by(external_id: order_params[:external_id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."external_id" = $1 LIMIT $2  [["external_id", "SAP-ORDER-1235"], ["LIMIT", 1]]

  def lock
    @order = Order.find_by(external_id: order_params[:id])

    if @order
      @order.update(locked_at: DateTime.now())
---
SELECT "orders".* FROM "orders" WHERE "orders"."external_id" = $1 LIMIT $2  [["external_id", "SAP-ORDER-1234"], ["LIMIT", 1]]
UPDATE "orders" SET "locked_at" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["locked_at", "2025-05-02T20:25:23+05:30"], ["updated_at", "2025-05-02 14:55:23.102284"], ["id", 1]]